[
  {
    "header": "NASA Ames Procurement Brochure Redesign",
    "description": "Clean design meets cosmic clarity. I redesigned a dense internal brochure and aligned it with NASA Ames’ spirit of wonder and precision. The result? I was told it “elevated the brochure to the next level.”",
    "image_urls": [
      "https://onecdn.io/media/c6aa5304-233f-4ed8-986d-37c5203bbd98/xlg2x"
    ],
    "overlay_header": "NASA Ames Procurement Brochure Redesign",
    "links": []
  },
  {
    "header": "Infographic - Deep Sentinel",
    "description": "Turning research into visual impact. I created this infographic to distill original research on security performance and differentiators. It highlights real costs, real risks, and smarter solutions for multi-tenant properties. The goal? Educate, engage, and empower faster decisions at a glance.",
    "image_urls": [
      "https://onecdn.io/media/9c7d8396-a676-43f1-be9e-ce5aac50473d/xlg2x"
    ],
    "overlay_header": "Infographic - Deep Sentinel",
    "links": []
  },
  {
    "header": "OhmniLabs 15-Second Product Intro Reel",
    "description": "This campaign set out to help people “get to know” the product through simple, visual storytelling. I created 15-second reels that highlighted the core features and showed the robot in action to make its usability unmistakable. The assets ran across Facebook and YouTube for eight months, strengthening recognition and priming the audience for the official launch.",
    "image_urls": [
      "https://onecdn.io/media/d0d0a12e-2ac8-409a-a23c-2ce70969dafd/xlg2x"
    ],
    "overlay_header": "OhmniLabs 15-Second Product Intro Reel",
    "links": []
  },
  {
    "header": "OhmniLabs Social Media Presence & Content Calendar",
    "description": "This project focused on building a consistent, engaging social media presence that reflected OhmniLabs’ values across robotics, healthcare, and community impact. I created and maintained a full social content calendar, designing posts around major holidays, healthcare initiatives, awareness days, product highlights, and company milestones. The ongoing series kept our channels active and aligned with brand voice, helping strengthen awareness, reinforce culture, and expand audience engagement across platforms.",
    "image_urls": [
      "https://onecdn.io/media/dc97fe59-e80e-46f9-b3c7-1a01f781e8b4/xlg2x"
    ],
    "overlay_header": "OhmniLabs Social Media Presence & Content Calendar",
    "links": []
  },
  {
    "header": "Trade Show Booth System - Deep Sentinel",
    "description": "Modular, bold, and brand-right; from full 10x20 exhibits to quick-set table throws. Each layout reinforced the “AI-Powered SuperGuards” message with confidence, not fear. The vermillion red, strong visuals, and clear tech benefits helped attract crowds and drive on-site engagement.",
    "image_urls": [
      "https://onecdn.io/media/e5916f56-68af-40c0-b025-2f39c47149ee/xlg2x"
    ],
    "overlay_header": "Trade Show Booth System - Deep Sentinel",
    "links": []
  },
  {
    "header": "Playful People Productions – Fundraiser Presentation",
    "description": "This project set out to create a one-of-a-kind fundraising presentation that captured both the heart of the organization and the financial realities of running a community theater nonprofit. I collaborated closely with the Playful People executive team to organize the content, shape the narrative, and tease out the most meaningful data points, stories, and visuals—balancing transparency, impact, and the playful spirit at the core of the company. The final presentation showcased the nonprofit’s achievements, needs, and community value in a dynamic, engaging format that supported donor outreach and helped strengthen the case for funding.",
    "image_urls": [
      "https://onecdn.io/media/dec3dbfd-4e12-4c25-8302-2a5aac03b10f/xlg2x"
    ],
    "overlay_header": "Playful People Productions – Fundraiser Presentation",
    "links": []
  },
  {
    "header": "OhmniLabs – Robot Fleet Management UX Redesign",
    "description": "Partnered with engineering, sales, and product to modernize the fleet management platform, produce launch-ready mockups, and improve usability through clearer navigation and visual structure. The work supported multiple releases and helped the system scale with new customer demands.",
    "image_urls": [
      "https://onecdn.io/media/60f434a1-49a6-424b-a4e7-2d92a89b956c/xlg2x"
    ],
    "overlay_header": "OhmniLabs – Robot Fleet Management UX Redesign",
    "links": []
  },
  {
    "header": "Magazine & Endorsement Ads - Superior Soaring",
    "description": "Designing elevation with clarity and trust.\nFor a regional aviation audience, I created a clean, data-forward magazine ad and matching Ground Launch Endorsement promos. These materials aimed to build credibility and drive bookings by highlighting consistent weather, certified training, and fixed pricing in the Arizona high desert.",
    "image_urls": [
      "https://onecdn.io/media/85b914ac-7fff-4825-8707-cf127f78be6f/xlg2x"
    ],
    "overlay_header": "Magazine & Endorsement Ads - Superior Soaring",
    "links": []
  },
  {
    "header": "Quotient Seasonal Shopping Trends Infographic Series",
    "description": "This project focused on turning real customer-behavior data into a single, visually cohesive infographic series that highlighted key seasonal shopping moments for brand partners. I illustrated a consistent family of characters, designed authentic scenes for Back-to-School, Mother’s Day, and Dads & Grads, and organized dense analytics into clear, approachable storytelling. The combined asset was used across email campaigns and B2B outreach to show how Quotient’s insights and promotional tools help brands understand consumer behavior and plan smarter seasonal campaigns.",
    "image_urls": [
      "https://onecdn.io/media/88efa791-33ca-4878-953b-3649dfbd8561/xlg2x"
    ],
    "overlay_header": "Quotient Seasonal Shopping Trends Infographic Series",
    "links": []
  },
  {
    "header": "Product Brochure & Sales Enablement Booklet - OhmniLabs",
    "description": "Designed a clear, sales-ready product brochure that showcased OhmniClean’s features, specs, and real-world use cases. It combined layout design, 3D mockups, and concise copywriting to support both sales presentations and customer onboarding.",
    "image_urls": [
      "https://onecdn.io/media/af38d579-4b89-45f2-8303-5cbfd47320f6/xlg2x"
    ],
    "overlay_header": "Product Brochure & Sales Enablement Booklet - OhmniLabs",
    "links": []
  },
  {
    "header": null,
    "description": null,
    "image_urls": [
      "https://onecdn.io/media/fa3c4382-891a-47bf-b28f-621f409915cd/xlg2x"
    ],
    "overlay_header": null,
    "links": []
  },
  {
    "header": "Kambria Live Conference",
    "description": "In partnership with Kambria and sponsor Tomochain, we curated an event during DeveloperWeek SF on Open Source & Ethics in AI and Blockchain. Despite budget constraints, I broadcasted it live on Facebook using three iPhones, a laptop, and an iPad. As the creative force behind graphics, I embraced the guerrilla-style broadcast, like the wizard behind the curtain in Oz.",
    "image_urls": [
      "https://onecdn.io/media/12777636-4501-4e62-bee5-6c6f14fa3e73/xlg2x"
    ],
    "overlay_header": "Kambria Live Conference",
    "links": []
  },
  {
    "header": "Kambria – Visual Pitch Deck Redesign",
    "description": "Collaborated with the COO to reshape Kambria’s standard pitch into a future-focused, accessible narrative about crypto, robotics, and innovation. I designed every slide, creating custom visuals and a refined structure that made the technology more understandable for broader audiences.",
    "image_urls": [
      "https://onecdn.io/media/1eb8685b-af35-43cd-8034-3814bf2c22a6/xlg2x"
    ],
    "overlay_header": "Kambria – Visual Pitch Deck Redesign",
    "links": []
  },
  {
    "header": "OhmniLabs Crowd Funding Campaign",
    "description": "Collaborating with our Executive and Republic teams, I enhanced their platform within given constraints. I provided guidance for the video, created visuals, and reinforced messaging. Our successful funding closure and adherence to Republic's terms were achieved. This campaign resulted in a 30% surge in social media engagement and organic traffic, marking a hard-earned victory.",
    "image_urls": [
      "https://onecdn.io/media/67e6c7ee-a8b3-471c-b2eb-40e88a98baef/xlg2x"
    ],
    "overlay_header": "OhmniLabs Crowd Funding Campaign",
    "links": []
  },
  {
    "header": "Quotient – Millennial Spending Insights Presentation",
    "description": "I transformed customer data and third-party millennial shopper research into a compelling presentation that my sales enablement team could use as a strategic storytelling tool. I led the visual direction and narrative structure, building the deck from scratch to turn complex insights into an accessible, persuasive customer-facing asset.",
    "image_urls": [
      "https://onecdn.io/media/4a2a4a77-21e8-43cf-913c-387b57331c5a/xlg2x"
    ],
    "overlay_header": "Quotient – Millennial Spending Insights Presentation",
    "links": []
  },
  {
    "header": "OhmniLabs - Crafting Compelling Promotional Content In-House",
    "description": "Here is a compilation of videos I created or directed to promote our products and features. In these examples, I utilized 3D, animation, filming, voice-over, acting, and coaching for some of our crew. The video units were also utilized as b-roll for some of our PR/news outlets. Our onsite team sought permission and received coaching to film specific angles to enable the creation of additional content. The majority of these videos were produced in-house by me.",
    "image_urls": [
      "https://onecdn.io/media/907bea70-a915-47d9-b5b6-ebfa646467ae/xlg2x"
    ],
    "overlay_header": "OhmniLabs - Crafting Compelling Promotional Content In-House",
    "links": []
  },
  {
    "header": "LinkedIn & Brand Refresh Brian Weisfeld",
    "description": "Helping an author’s message travel farther. I built a cohesive visual identity across his LinkedIn, school visits, and book tours. From header graphics and stickers to “You’re the Boss” shirt designs, every piece reinforced his message: bold ideas start young.",
    "image_urls": [
      "https://onecdn.io/media/f80cc410-36b9-4d8e-886b-d2dee9a2d703/xlg2x"
    ],
    "overlay_header": "LinkedIn & Brand Refresh Brian Weisfeld",
    "links": []
  },
  {
    "header": "Presentation Design - Brian Weisfeld",
    "description": "Built from a t-shirt. Delivered like a TED Talk. For Brian’s keynote I used the core message —Curiosity, Creativity, Risk, Grit, Persistence—as the structural theme. The presentation speaks to adult audiences while keeping the energy and clarity of his work with young entrepreneurs.",
    "image_urls": [
      "https://onecdn.io/media/b07861f9-17a6-4c63-aec0-e05b23122770/xlg2x"
    ],
    "overlay_header": "Presentation Design - Brian Weisfeld",
    "links": []
  },
  {
    "header": "AD Print Campaign Local Campaign - Superior Soaring",
    "description": "Local outreach with a lift of personality. I designed these print flyers to help Superior Soaring promote lessons and certifications across the Phoenix area. Friendly, direct copy and bright visuals were key to attracting new pilots—from first-time flyers to serious trainees. The goal? Make aviation feel personal and approachable.",
    "image_urls": [
      "https://onecdn.io/media/a3915bab-d85d-458b-afc2-45396a5df0ef/xlg2x"
    ],
    "overlay_header": "AD Print Campaign Local Campaign - Superior Soaring",
    "links": []
  },
  {
    "header": "Investor Pitch Deck - Deep Sentinel",
    "description": "Turning AI into a story that resonates. I crafted t a compelling investor story and slide deck for a funding round. I led design, narrative, anchored by my line: “The Security Paradox: Inundated with Data, Starved for Intelligence.” This became the central theme, reframing the story.",
    "image_urls": [
      "https://onecdn.io/media/57dc414c-fe42-49f0-a3a0-4f94e686f108/xlg2x"
    ],
    "overlay_header": "Investor Pitch Deck - Deep Sentinel",
    "links": []
  },
  {
    "header": "Brand System & Website for Ingenuity",
    "description": "Bringing clarity and confidence to a growth consultancy.\nI built the color system, layout design, and copy direction for Ingenuity’s brand refresh—then applied it across their website and core visuals. The goal: clarity, confidence, and momentum for a high-growth consultancy serving startups and VCs.",
    "image_urls": [
      "https://onecdn.io/media/372ba1e0-c957-47b7-b3e2-952114db0578/xlg2x"
    ],
    "overlay_header": "Brand System & Website for Ingenuity",
    "links": []
  },
  {
    "header": "Coupons.com - Booth Design, Team Management & Execution",
    "description": "Designed and project-managed the full 20×20 Coupons.com expo booth, overseeing construction, managing my team and the budget, and coordinating with show reps, sales, and onsite crews in Chicago. The booth became a show highlight, ultimately hosting a high-visibility Dollar General prep presentation and drawing strong attendee traffic.",
    "image_urls": [
      "https://onecdn.io/media/dc8c0734-e4c0-4dce-92a7-a7056783d85d/xlg2x"
    ],
    "overlay_header": "Coupons.com - Booth Design, Team Management & Execution",
    "links": []
  },
  {
    "header": "Breinify Home Page Re-design",
    "description": "Breinify's AI Home Page Re-design showcases compelling case studies and real-world campaign results with straightforward headlines. This redesign reflects the brand's unified identity and empowers retailers, CPG brands, and agencies to maximize AI personalization for impactful consumer engagement.",
    "image_urls": [
      "https://onecdn.io/media/d024d94c-a572-4c85-a868-485385b0e200/xlg2x"
    ],
    "overlay_header": "Breinify Home Page Re-design",
    "links": []
  },
  {
    "header": null,
    "description": null,
    "image_urls": [
      "https://onecdn.io/media/9e908e1e-227e-419d-9d39-777a68da7c93/xlg2x"
    ],
    "overlay_header": null,
    "links": []
  },
  {
    "header": null,
    "description": null,
    "image_urls": [
      "https://onecdn.io/media/c2c45afa-57ee-4750-a424-26816fff90c5/xlg2x"
    ],
    "overlay_header": null,
    "links": []
  },
  {
    "header": null,
    "description": null,
    "image_urls": [
      "https://onecdn.io/media/153bc05a-1900-4b1c-97a9-71865e8159ff/xlg2x"
    ],
    "overlay_header": null,
    "links": []
  },
  {
    "header": "#16 NASCAR Car Wrap & Promotion",
    "description": "Ahead of the Coupons.com IPO, I led the art direction and design of the #16 NASCAR car wrap in collaboration with Matt Kenseth’s team, NASCAR, PR, and internal marketing leadership. I guided visual decisions to ensure the brand stood out at racing speed while maintaining consistency with existing brand equity.\n\nI coordinated closely with the CMO, sales, and design teams, aligning sponsor requirements and campaign goals across stakeholders. The final wrap and photo assets were used across national marketing, sales presentations, and partner campaigns, expanding brand visibility during a critical growth moment.",
    "image_urls": [
      "https://onecdn.io/media/0a89c158-affb-487a-b4c4-095edd224e82/xlg2x"
    ],
    "overlay_header": "#16 NASCAR Car Wrap & Promotion",
    "links": []
  },
  {
    "header": "Deep Sentinel – Sales Enablement Template Redesign",
    "description": "I partnered with Deep Sentinel’s Sales Enablement team to modernize and standardize the company’s sales presentation library. I led the rebuild of decks and templates in Beautiful.ai, updating legacy content, creating new visuals, and establishing a scalable, easy-to-maintain system.\n\nUsing AI-driven presentation tools, I developed vertical-specific, sales-focused decks, authored the brand and messaging guidelines for the platform, and trained the sales team on day-to-day use. The result was a more consistent, efficient, and adaptable presentation ecosystem aligned with evolving business needs.",
    "image_urls": [
      "https://onecdn.io/media/56d415dc-1746-4c0d-8131-91812dd803ab/xlg2x"
    ],
    "overlay_header": "Deep Sentinel – Sales Enablement Template Redesign",
    "links": []
  },
  {
    "header": "OhmniLabs: Web Redesign",
    "description": "I collaborated with cross-functional teams to redesign OhmniLabs’ website (v5), using behavioral data, SEO, sales insights, and customer feedback to structure pages around clear CTAs and segmentation paths. Launched following a strong Q4 and major press—including the Super Bowl and New York Times—the redesign drove a 4× increase in engagement and 2× higher click-through rates, while unifying the brand across product, software, and marketing.",
    "image_urls": [
      "https://onecdn.io/media/e14c8ce7-71e8-4144-8659-5b331299592f/xlg2x"
    ],
    "overlay_header": "OhmniLabs: Web Redesign",
    "links": []
  },
  {
    "header": null,
    "description": null,
    "image_urls": [
      "https://onecdn.io/media/08c29449-2ab8-4903-9816-b6a713713349/xlg2x"
    ],
    "overlay_header": null,
    "links": []
  },
  {
    "header": null,
    "description": null,
    "image_urls": [
      "https://onecdn.io/media/adc19ac5-7e53-4694-a869-4b00cf9a00a6/xlg2x"
    ],
    "overlay_header": null,
    "links": []
  },
  {
    "header": null,
    "description": null,
    "image_urls": [
      "https://onecdn.io/media/34195fbc-691c-4799-9a66-c993f0371a30/xlg2x"
    ],
    "overlay_header": null,
    "links": []
  },
  {
    "header": null,
    "description": null,
    "image_urls": [
      "https://onecdn.io/media/0cbd8fcb-f985-49b1-8f8f-5004758ee110/xlg2x"
    ],
    "overlay_header": null,
    "links": []
  },
  {
    "header": "Quotient: Annual National Sales Meeting",
    "description": "I led the creative direction and experience design for Quotient’s annual national sales meeting—one of seven events delivered over nine years. Working closely with Sales, Marketing, and the C-suite, I shaped the stage visuals, presentations, and storytelling for an audience that included partners such as Gap, Home Depot, and P&G, earning multiple internal awards for impact and execution. My role also included overseeing AV coordination, sizzle reels, and branded assets to ensure a cohesive, high-impact experience end to end.",
    "image_urls": [
      "https://onecdn.io/media/8fe100f9-46ef-4c35-bcf1-4022178a00de/xlg2x"
    ],
    "overlay_header": "Quotient: Annual National Sales Meeting",
    "links": []
  },
  {
    "header": "Aerial Engagement – 15-Second Flight Simulator Ad Series",
    "description": "Transformed raw simulator footage into short, high-impact ads centered on the immersive feel of flight training. I crafted the copy, pacing, and visual flow based on the team’s marketing data to sharpen relevance and boost engagement.",
    "image_urls": [
      "https://onecdn.io/media/12cd6f52-fc9e-466f-9ce1-9bbd28af47fd/xlg2x"
    ],
    "overlay_header": "Aerial Engagement – 15-Second Flight Simulator Ad Series",
    "links": []
  },
  {
    "header": "Breinify: Brand Refresh & Guidelines System",
    "description": "I partnered closely with Breinify’s CMO and CEO to lead a full brand refresh, including a logo update, comprehensive brand book, website, and sales materials. The new brand guidelines were designed as a scalable system, enabling consistent application across the entire company—from marketing and sales to product and partnerships.",
    "image_urls": [
      "https://onecdn.io/media/92818489-4734-4f61-98d4-00419c6bfcda/xlg2x"
    ],
    "overlay_header": "Breinify: Brand Refresh & Guidelines System",
    "links": []
  }
]